{
  "text": {
    "bộ": 11,
    "camera": 13,
    "imou": 37,
    "4g": 0,
    "năng": 54,
    "lượng": 44,
    "mặt": 47,
    "trời": 73,
    "gồm": 27,
    "những": 52,
    "gì": 25,
    "cho": 15,
    "tôi": 77,
    "biết": 3,
    "thông": 67,
    "tin": 71,
    "về": 83,
    "sử": 65,
    "dụng": 23,
    "pin": 58,
    "chạy": 17,
    "bằng": 10,
    "có": 18,
    "phụ": 57,
    "kiện": 39,
    "bảo": 9,
    "hành": 32,
    "solar": 61,
    "được": 89,
    "bao": 2,
    "lâu": 42,
    "quay": 60,
    "đêm": 87,
    "không": 38,
    "tấm": 80,
    "của": 21,
    "công": 19,
    "suất": 62,
    "nhiêu": 49,
    "dung": 22,
    "lưu": 43,
    "trữ": 75,
    "là": 41,
    "độ": 91,
    "phân": 55,
    "giải": 24,
    "này": 53,
    "hỗ": 36,
    "trợ": 74,
    "thẻ": 69,
    "nhớ": 51,
    "cần": 20,
    "số": 64,
    "điện": 86,
    "thoại": 66,
    "để": 90,
    "liên": 40,
    "hệ": 34,
    "trực": 76,
    "tiếp": 72,
    "qua": 59,
    "zalo": 85,
    "hoặc": 31,
    "gặp": 26,
    "nhân": 50,
    "viên": 82,
    "muốn": 46,
    "người": 48,
    "thật": 68,
    "xin": 84,
    "chào": 16,
    "hello": 28,
    "hi": 30,
    "buổi": 6,
    "sáng": 63,
    "bạn": 8,
    "chiều": 14,
    "tối": 81,
    "hey": 29,
    "thể": 70,
    "hỏi": 35,
    "ai": 1,
    "ở": 92,
    "đó": 88,
    "tạm": 78,
    "biệt": 4,
    "bye": 7,
    "hẹn": 33,
    "lại": 45,
    "phải": 56,
    "bot": 5,
    "tạo": 79,
    "bởi": 12
  },
  "intent": {
    "ask_about_imou_solar_camera": 0,
    "ask_imou_solar_camera_specs": 1,
    "khongbiettraloi": 6,
    "gapnhanvien": 3,
    "greet": 5,
    "goodbye": 4,
    "bot_challenge": 2
  },
  "response": null,
  "action_name": {
    "action_listen": 6,
    "action_restart": 7,
    "action_session_start": 9,
    "action_default_fallback": 4,
    "action_deactivate_loop": 1,
    "action_revert_fallback_events": 8,
    "action_default_ask_affirmation": 2,
    "action_default_ask_rephrase": 3,
    "action_two_stage_fallback": 10,
    "action_unlikely_intent": 11,
    "action_back": 0,
    "action_extract_slots": 5,
    "utter_gapnhanvien": 15,
    "utter_khongbiettraloi": 18,
    "utter_ask_about_imou_solar_camera": 12,
    "utter_ask_imou_solar_camera_specs": 13,
    "utter_bot_challenge": 14,
    "utter_goodbye": 16,
    "utter_greet": 17
  },
  "action_text": null,
  "intent_response_key": null
}